let str = `6月10日 09:50
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU4F18315)，快去兑换吧 前往礼包中心查看详情吧。
6月10日 10: 17
您已报名成功，请切换分区开播！
6月10日 12: 19
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9EEA8AF)，快去兑换吧 前往礼包中心查看详情吧。
6月10日 17: 25
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU52D6C01)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份好友传送 * 2，其中兑换码为：卡号(DOUYUC285600)，快去兑换吧 前往礼包中心查看详情吧。
6月10日 20: 39
您好，由于您未使用斗鱼直播工具开播，系统识别到您的直播流中未包含斗鱼水印。为更好保护您的直播内容版权，您可采用以下两种方式开播：1、使用斗鱼直播工具：斗鱼APP、斗鱼直播伴侣。2、如您使用其它直播工具，可自行设置斗鱼水印，点击如何添加斗鱼水印查看操作流程。若您已添加水印，可忽略此信息！
6月10日 21: 46
亲爱的主播，您于【2022 - 06 - 10 21: 46: 30】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月10日 22: 13
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB0C24D6)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA3B41BD)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB90399E)，快去兑换吧 前往礼包中心查看详情吧。
6月10日 23: 46
亲爱的主播，您于【2022 - 06 - 10 23: 46: 14】完成【开播4小时（240分钟）任务】获得【500流量扶持（7天）】* 1
6月10日 23: 56
亲爱的主播，您于【2022 - 06 - 10 23: 56: 10】完成【日任务 | 22点至24点开播2小时任务】获得【300流量扶持（7天）】* 1
6月11日 00: 25
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU4E14EA8)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU507E2C2)，快去兑换吧 前往礼包中心查看详情吧。
6月11日 07: 31
恭喜您在激战2斗龙节直播季活动中获得1份好友传送 * 2，其中兑换码为：卡号(DOUYUC521FAB)，快去兑换吧 前往礼包中心查看详情吧。
6月11日 07: 47
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9FF7BF1)，快去兑换吧 前往礼包中心查看详情吧。
6月11日 07: 47
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB659108)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB38F19B)，快去兑换吧 前往礼包中心查看详情吧。
6月11日 08: 40
亲爱的主播，您于【2022 - 06 - 11 08: 40: 44】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月11日 08: 46
亲爱的主播，您于【2022 - 06 - 11 08: 46: 47】完成【签到任务任务】获得
亲爱的主播，您于【2022 - 06 - 11 08: 46: 47】完成【签到1天任务】获得【50Exp 主播经验】* 1
6月11日 09: 41
亲爱的主播，您于【2022 - 06 - 11 09: 41: 13】完成【连续直播100分钟任务】获得【100Exp 主播经验】* 100
6月11日 10: 40
亲爱的主播，您于【2022 - 06 - 11 10: 40: 51】完成【开播4小时（240分钟）任务】获得【500流量扶持（7天）】* 1
6月11日 10: 46
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA424776)，快去兑换吧 前往礼包中心查看详情吧。
6月11日 13: 26
亲爱的主播，您于【2022 - 06 - 11 13: 26: 43】完成【今日发送弹幕人数达到3人任务】获得【300流量扶持（7天）】* 1
6月11日 13: 41
亲爱的主播，您于【2022 - 06 - 11 13: 41: 08】完成【开播7小时（420分钟）任务】获得【1000流量扶持（7天）】* 1
6月11日 15: 22
亲爱的主播，您于【2022 - 06 - 11 15: 22: 27】完成【今日累计直播300分钟任务】获得【300Exp 主播经验】* 300
6月11日 23: 56
亲爱的主播，您于【2022 - 06 - 11 23: 56: 10】完成【日任务 | 22点至24点开播2小时任务】获得【300流量扶持（7天）】* 1
6月12日 00: 05
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU521DD62)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份好友传送 * 2，其中兑换码为：卡号(DOUYUBE24C78)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU507BAC9)，快去兑换吧 前往礼包中心查看详情吧。
6月12日 00: 05
恭喜您在激战2斗龙节直播季活动中获得1份黑狮钥匙 * 1，其中兑换码为：卡号(DOUYUCF348CC)，快去兑换吧 前往礼包中心查看详情吧。
6月12日 12: 05
亲爱的主播，您于【2022 - 06 - 12 12: 05: 52】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月12日 14: 06
亲爱的主播，您于【2022 - 06 - 12 14: 06: 05】完成【开播4小时（240分钟）任务】获得【500流量扶持（7天）】* 1
6月12日 14: 22
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB66AD92)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA494682)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB0BA1BE)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9E865A5)，快去兑换吧 前往礼包中心查看详情吧。
6月12日 17: 06
亲爱的主播，您于【2022 - 06 - 12 17: 06: 08】完成【开播7小时（420分钟）任务】获得【1000流量扶持（7天）】* 1
6月12日 17: 50
亲爱的主播，您于【2022 - 06 - 12 17: 50: 25】完成【签到2天任务】获得【50流量扶持（1天）】* 1
亲爱的主播，您于【2022 - 06 - 12 17: 50: 25】完成【签到任务任务】获得
亲爱的主播，您于【2022 - 06 - 12 17: 50: 38】完成【连续直播100分钟任务】获得【100Exp 主播经验】* 100
亲爱的主播，您于【2022 - 06 - 12 17: 50: 39】完成【今日累计直播300分钟任务】获得【300Exp 主播经验】* 300
6月12日 19: 23
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 500，其中兑换码为：卡号(DOUYUC0EA1D0)，快去兑换吧 前往礼包中心查看详情吧。
6月13日 00: 17
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU55BC251)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份好友传送 * 2，其中兑换码为：卡号(DOUYUC4C24FE)，快去兑换吧 前往礼包中心查看详情吧。
6月13日 00: 17
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU5643276)，快去兑换吧 前往礼包中心查看详情吧。
6月13日 06: 03
亲爱的主播，您由于：保持直播出勤率，表现良好，增加1分，请继续保持。合理播放内容，共同净化互联网环境！了解积分，请阅读主播积分管理详细规则https://www.douyu.com/cms/ptgz/202008/06/16147.shtml。
6月13日 20: 14
您好，由于您未使用斗鱼直播工具开播，系统识别到您的直播流中未包含斗鱼水印。为更好保护您的直播内容版权，您可采用以下两种方式开播：1、使用斗鱼直播工具：斗鱼APP、斗鱼直播伴侣。2、如您使用其它直播工具，可自行设置斗鱼水印，点击如何添加斗鱼水印查看操作流程。若您已添加水印，可忽略此信息！
6月13日 21: 41
亲爱的主播，您于【2022 - 06 - 13 21: 41: 29】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月13日 22: 17
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9E67861)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB85F6ED)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA5CF728)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB16B148)，快去兑换吧 前往礼包中心查看详情吧。
6月13日 23: 41
亲爱的主播，您于【2022 - 06 - 13 23: 41: 13】完成【开播4小时（240分钟）任务】获得【500流量扶持（7天）】* 1
6月14日 11: 01
亲爱的斗鱼用户，为营造公正、良好的直播环境，斗鱼特设立举报邮箱：sj @douyu.tv，举报微信：dysjjcb，该邮箱、微信由斗鱼审计监察部管理。鼓励实名投诉举报，对投诉举报人信息及内容严格保密，对被查实的信息将给予举报人奖励。
6月14日 17: 58
亲爱的斗鱼用户，为营造公正、良好的直播环境，斗鱼特设立举报邮箱：sj @douyu.tv，举报微信：dysjjcb，该邮箱、微信由斗鱼审计监察部管理。鼓励实名投诉举报，对投诉举报人信息及内容严格保密，对被查实的信息将给予举报人奖励。
6月14日 22: 06
亲爱的主播，您于【2022 - 06 - 14 22: 06: 24】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月14日 23: 30
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB1C4D54)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA47D8E6)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9E37B7C)，快去兑换吧 前往礼包中心查看详情吧。
6月14日 23: 30
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB8BBA9F)，快去兑换吧 前往礼包中心查看详情吧。
6月14日 23: 56
亲爱的主播，您于【2022 - 06 - 14 23: 56: 06】完成【日任务 | 22点至24点开播2小时任务】获得【300流量扶持（7天）】* 1
6月15日 00: 05
恭喜您在激战2斗龙节直播季活动中获得1份好友传送 * 2，其中兑换码为：卡号(DOUYUBFB2704)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU573F8FB)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU513F13F)，快去兑换吧 前往礼包中心查看详情吧。
6月15日 16: 01
“斗鱼频道孵化官”招募斗鱼在读大学生啦！有现金、实践证明、斗鱼周边等奖励相送！快戳链接了解一下吧~
    6月15日 19: 51
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYUA0B23EA)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB37579C)，快去兑换吧 前往礼包中心查看详情吧。
6月15日 21: 16
亲爱的主播，您于【2022 - 06 - 15 21: 16: 20】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1
6月15日 22: 41
恭喜您在激战2斗龙节直播季活动中获得1份大量制作材料包 * 1，其中兑换码为：卡号(DOUYUA456B30)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUB821E3C)，快去兑换吧 前往礼包中心查看详情吧。
6月15日 23: 16
亲爱的主播，您于【2022 - 06 - 15 23: 16: 13】完成【开播4小时（240分钟）任务】获得【500流量扶持（7天）】* 1
6月15日 23: 56
亲爱的主播，您于【2022 - 06 - 15 23: 56: 05】完成【日任务 | 22点至24点开播2小时任务】获得【300流量扶持（7天）】* 1
00: 09
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_3，其中兑换码为：卡号(DOUYU50233AD)，快去兑换吧 前往礼包中心查看详情吧。
06: 03
亲爱的主播，您由于：保持直播出勤率，表现良好，增加1分，请继续保持。合理播放内容，共同净化互联网环境！了解积分，请阅读主播积分管理详细规则https://www.douyu.com/cms/ptgz/202008/06/16147.shtml。
21: 09
恭喜您在激战2斗龙节直播季活动中获得1份爵位1天，其中兑换码为：卡号(DOUYU9D450D5)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_2，其中兑换码为：卡号(DOUYUBA69272)，快去兑换吧 前往礼包中心查看详情吧。
恭喜您在激战2斗龙节直播季活动中获得1份宝石 * 25_1，其中兑换码为：卡号(DOUYUB068B0E)，快去兑换吧 前往礼包中心查看详情吧。
21: 41
亲爱的主播，您于【2022 - 06 - 16 21: 41: 29】完成【今日开播2小时任务】获得【300流量扶持（7天）】* 1`

function parseStr(str){
    let reg=/DOUYU\w*/g
    let res=str.match(reg)
    console.log(res)
}
parseStr(str)